IDEA Open Model
EdgeOrientationType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Edge position type
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum EdgeOrientationType
Public Enumeration EdgeOrientationType
Members
Member name | Value | Description
FromBegin | 0 |  Distance measured from the beginning of edge
FromEnd | 1 |  Distance measured from the end of edge
See Also
Reference
IdeaRS.OpenModel.Detail Namespace